Table of Contents
 Enum SetupValueEc2
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Setup value types Ec2
public enum SetupValueEc2
Fields
AllowCheckInAgeLess3Days = 152
true to allow check in concrete age less than 3 days
AlphaCw = 32
AlphaCw
AnchorageDetailType = 122
anchorage of reinforcement according to type
BLRPRecisionCheckValue = 201
precision of bridge load rating - check value
BentUpBarsReduction = 154
reduction coefficinet of bent-up bars
CalculateShrinkage = 205
calculate influence of shrinkage to stiffnesses
CalculateSrMaxAccUserSettings = 135
sr,max, is calculated according to user
CalculationOfStressLimitationK1 = 207
calculation of stress limitation k1
CalculationOfStressLimitationK2 = 208
calculation of stress limitation k2
CalculationOfStressLimitationK3 = 209
calculation of stress limitation k3
CheckCrackedCss = 74
Check cracks during shear calculation
CheckCrossSectionCrackedIfOneCracked_7_2_Chapter = 102
switch if the cross section should be calculated as cracked
CoeffCrdc = 28
CoeffCrdc
CoeffK1 = 29
CoeffK1
CoeffKl = 49
lateral shear - coefficient k (6.2.4 (6))
CoeffKp = 33
CoeffKp
CoeffNi = 104
strength reduction factor
CoeffNi1 = 31
CoeffNi1
CoeffNi1_EN2_2 = 183
coeff ni1 for EN2-2
CoeffVmin = 30
CoeffVmin
CoefficientOfTensionConcrete = 195
coefficient witch reduce the tension strength
CracWidthNationalAnnex = 160
use some annex specialities in common eurocode
CracksPassThrough = 159
CracksPassThrough
CrossSectionCrackedPlate = 134
on - the cross-section is calculated always as cracked
DecompressionLimit = 77
The decompression limit requires that all parts of the bonded tendons or duct lie at least 25 mm within concrete in compression for 1992-1-1
DecompressionLimit_2 = 78
The decompression limit requires that all parts of the bonded tendons or duct lie at least 25 mm within concrete in compression for 1992_2
DecompressionLimit_3 = 167
NCI re 7.3.1 (5) In order to keep within the decompression limit, it is required that the concrete surrounding the tendon is in compression over a width of 100 mm or 1/10 of the depth of section (whichever is greater). Stresses are to be checked in state II.
DetailingBracketMethodType = 120
calculation method of transversal reinforcement
DivisionStrain = 70
Division of the plane interaction diagram
EndOfCuring = 71
The age of the concrete (days) at the beginning of drying shrinkage (or swelling) in days. Normally this is at the end of curing.
Equation629 = 171
Equation 6.29 acc. to DIN NCI re 6.3.2 (4)
Equation631 = 172
Equation 6.31 acc. to DIN NCI re 6.3.2 (5)
FatigueJointCohesion = 175
Under fatigue or dynamic loads, the values for c in 6.2.5 (1) should be halved.
FatigueMethod = 133
6.8.7 Verification of concrete under compression or shear
FindOnly2DPlaneDeformation = 196
FindOnly2DPlaneDeformation
HighStrengthConcrete = 163
High strength concrete for DIN NCI re 3.1.2 (6)
ImperfectionDirection = 110
direction of imperfection for second order effect
IncreaseJointResistance = 170
the bearing capacity of the reinforcement crossing the joint due to shear friction (third term of the equation) may be increased to become ρ fyd (1,2 μ sin α + cos α).
InnerPerimeter = 164
Inner perimeter for DIN NCI re 3.1.4 (5)
InteractionDiagramCheckType = 9
InteractionDiagramCheckType
InteractionDiagramDivision = 112
division of interaction diagram for export
InteractionDiagramExportType = 146
type of interaction diagram for export
InterpolationCurve = 111
type of interpolate curce
IsSetMrForULSMNKappaDiagram = 156
IsSetMrForULSMNKappaDiagram
IsSetPrecissionForNullForces = 147
settings if null forces are checked with some precissions
IterationPrecission = 7
Iteration Precission
IterationSteps = 8
Iteration Steps
JointShearStressType = 138
Type of shear stress calculation
LimitCheckValue = 0
The limit check value, when check is over - check is not satisfactory
LimitDeflectionAdvanced = 106
limit value of deflection for deflection requrement advanced
LimitDeflectionNormal = 105
limit value of deflection for deflection requirement normal
LimitDeflectionValue = 108
limit value as value
LimitLeverArm = 165
Limit for lever arm acc. to DIN NCI re 6.2.3 (1)
LinearStiffnessForDeflection = 109
linear stiffness for deflection calculation - only for debug
MaxBentUpReinfDist = 178
maximum longitudinal spacing of bent-up bars
MaxDisplayCheckValue = 1
The infinity check value. This will be displayed when the check value equals to infinity or check wasn't calculated.
MaxHorReinfDistWall = 83
Maximal spacing of horizontal reinforcement
MaxHorReinfDistWall_EN2_2 = 188
maximum horizontal long reinf distance for EN2-2
MaxLengthOfZone = 107
maximum length of zone to divide member for stiffness calculation
MaxLongReinfDist = 37
maximum long reinf distance
MaxLongReinfPercBeam = 35
maximum long reinf percentage
MaxLongReinfPercBeam_EN2_2 = 185
maximum long reinf percentage for EN2-2
MaxLongReinfPercColumn = 43
maximum long reinf percentage
MaxMainReinfDistSlab = 89
Maximal spacing of main reinforcement
MaxMainReinfDistSlab_EN2_2 = 186
maximum main long reinf distance for EN2-2
MaxMainReinfPercSlab = 87
Maximal reinforcement ratio of main reinforcement
MaxReinfDistDeepBeam = 85
Maximal spacing of reinforcement
MaxShearReinfDistBeam = 40
maximum shear reinf distance
MaxShearReinfDistColumn = 46
maximum shear reinf distance
MaxShearReinfDistSlab = 180
maximum longitudinal spacing of successive series of links for slab
MaxShearReinfPercBeam = 39
maximum shear reinf percentage
MaxShearReinfTransDist = 41
maximum shear reinf trans distance
MaxShearReinfTransDistSlab = 181
maximum transverse spacing of shear reinforcement for slab
MaxTransReinfDistSlab = 90
Maximal spacing of transverse reinforcement
MaxTransReinfDistSlab_EN2_2 = 187
maximum transversal long reinf distance for EN2-2
MaxVertReinfDistWall = 81
Maximal spacing of vertical reinforcement
MaxVertReinfPercWall = 80
Maximal reinforcement ratio of vertical reinforcement
MinAnchLenShear = 121
minimum anchorage length of shear reinforcement
MinDuctHorDist = 97
Minimal horizontal distance of ducts
MinDuctVertDist = 96
Minimal vertical distance of ducts
MinHorReinfPercWall = 82
Minimal reinforcement ratio of horizontal reinforcement
MinLongReinfDiamColumn = 44
minimum long reinf diameter
MinLongReinfDist = 36
minimum long reinf distance
MinLongReinfPercBeam = 34
detailing beam minimum long reinf percentage
MinLongReinfPercBeam_EN2_2 = 184
minimum long reinf percentage for EN2-2
MinLongReinfPercColumn = 42
detailing column minimum long reinf percentage
MinMainReinfPercSlab = 86
Minimal reinforcement ratio of main reinforcement
MinNoBarCircColumn = 45
minimum number of bars of long reinf
MinReinfPercDeepBeam = 84
Minimal reinforcement ratio
MinReinfPercDeepBeam_EN2_2 = 189
minimum long reinf percentage for EN2-2
MinShearReinfDiamColumn = 47
minimum shear reinf diameter
MinShearReinfDiamColumn_EN2_2 = 182
minimum shear reinf diameter EN2-2
MinShearReinfPercBeam = 38
minimum shear reinf percentage
MinShearReinfPercSlab = 179
Minimal shear reinforcement percentage for slab
MinTendonHorDist = 95
Minimal horizontal distance of tendons
MinTendonVertDist = 94
Minimal vertical distance of tendons
MinTransReinfPercSlab = 88
Minimal reinforcement ratio of transverse reinforcement
MinVertReinfPercWall = 79
Minimal reinforcement ratio of vertical reinforcement
ModulusType = 61
Type of E-modulus, which is used in calculations
ModulusTypeLongTermEffects = 137
Type of E-modulus, which is used in calculations of long-term effects
NA_1_Wmax_Ec2 = 150
NA_1_Wmax_Ec2
NA_2_4_2_2_Gamma_p_fav = 66
Partial factors for prestress The value of 􀁊P,fav for use in a Country may be found in its National Annex. The recommended value for persistent and transient design situations is 1,0. This value may also be used for fatigue verification
NA_2_4_2_2_Gamma_p_unfav = 67
Partial factors for prestress The value of 􀁊P,unfav in the stability limit state for use in a Country may be found in its National Annex. The recommended value for global analysis is 1,3.
NA_5_10_2_1_1_K1 = 98
maximum tendon stress coeff k1 in 5.10.2.1(1)P
NA_5_10_2_1_1_K2 = 99
maximum tendon stress coeff k2 in 5.10.2.1(1)P
NA_5_10_3_2_K7 = 100
maximum tendon stress coeff k7 in 5.10.3(2)
NA_5_10_3_2_K8 = 101
maximum tendon stress coeff k8 in 5.10.3(2)
NA_5_10_9_r_inf_post = 65
Effects of prestressing at serviceability limit state and limit state of fatigue The values of rsup and rinf for use in a Country may be found in its National Annex. The recommended values are:
for post-tensioning with bonded tendons: rsup = 1,10 and rinf = 0,90
when appropriate measures (e.g. direct measurements of pretensioning) are taken: rsup = rinf = 1,0.
NA_5_10_9_r_inf_pre = 63
Effects of prestressing at serviceability limit state and limit state of fatigue The values of rsup and rinf for use in a Country may be found in its National Annex. The recommended values are:
for pre-tensioning or unbonded tendons: rsup = 1,05 and rinf = 0,95
when appropriate measures (e.g. direct measurements of pretensioning) are taken: rsup = rinf = 1,0.
NA_5_10_9_r_sup_post = 64
Effects of prestressing at serviceability limit state and limit state of fatigue The values of rsup and rinf for use in a Country may be found in its National Annex. The recommended values are:
for post-tensioning with bonded tendons: rsup = 1,10 and rinf = 0,90
when appropriate measures (e.g. direct measurements of pretensioning) are taken: rsup = rinf = 1,0.
NA_5_10_9_r_sup_pre = 62
Effects of prestressing at serviceability limit state and limit state of fatigue The values of rsup and rinf for use in a Country may be found in its National Annex. The recommended values are:
for pre-tensioning or unbonded tendons: rsup = 1,05 and rinf = 0,95
when appropriate measures (e.g. direct measurements of pretensioning) are taken: rsup = rinf = 1,0.
NA_5_2_5_Theta0 = 55
The the basic value of imperfections (See 5.2 (5)).
NA_5_5_K1 = 140
returns K1 coefficient according to 5.5 EN 1992-1-1
NA_5_5_K2 = 141
returns K2 coefficient according to 5.5 EN 1992-1-1
NA_5_5_K3 = 142
returns K3 coefficient according to 5.5 EN 1992-1-1
NA_5_5_K4 = 143
returns K4 coefficient according to 5.5 EN 1992-1-1
NA_5_5_K5 = 144
returns K5 coefficient according to 5.5 EN 1992-1-1
NA_5_5_K5_fck_BiggerThan_50MPa = 190
returns K5 coefficient according to DIN EN 1992-2/NA April 2013 NDP re 5.5 (4)
NA_5_5_K6 = 145
returns K6 coefficient according to 5.5 EN 1992-1-1
NA_5_5_K6_fck_BiggerThan_50MPa = 191
returns K5 coefficient according to DIN EN 1992-2/NA April 2013NDP re 5.5 (4)
NA_5_8_6_3_GammaCe = 56
Partial safety factor for second order effect design, see 5.8.6 (3).
NA_6_5_2_3_Ni = 113
coefficient ni - SaT
NA_6_5_4_4_K1 = 114
coefficient k1 - SaT
NA_6_5_4_4_K2 = 115
coefficient k2 - SaT
NA_6_5_4_4_K3 = 116
coefficient k3 - SaT
NA_7_2_K1 = 11
EN 1992-1-1 7.2 (2) DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (2)
NA_7_2_K2 = 12
EN 1992-1-1 7.2 (3) DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (3)
NA_7_2_K3 = 13
EN 1992-1-1 7.2 (5) DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (5)
NA_7_2_K4 = 14
EN 1992-1-1 7.2 (5) DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (5)
NA_7_2_K5 = 15
EN 1992-1-1 7.2 (5) DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (5)
NA_7_3_1_DecompressionDistance = 68
The durability of prestressed members may be more critically affected by cracking. In the absence of more detailed requirements, it may be assumed that limiting the calculated crack widths to the values of wmax given in Table 7.1N, under the frequent combination of loads, will generally be satisfactory for prestressed concrete members. The decompression limit requires that all parts of the bonded tendons or duct lie at least 100 mm within concrete in compression
NA_7_3_1_Wmax_Ec2_1_1 = 10
NA_7_3_1_Wmax_Ec2_1_1
NA_7_3_1_Wmax_Ec2_2 = 73
NA_7_3_1_Wmax_Ec2_2
NA_7_3_4_K1 = 192
is a coefficient which takes account of the bond properties of the bonded reinforcement
NA_7_3_4_K2 = 193
is a coefficient which takes account of the distribution of strain
NA_7_3_4_K3 = 16
NA_7_3_4_K3
NA_7_3_4_K4 = 17
NA_7_3_4_K4
NA_8_3_2_MinDiameterOfMandrel = 103
minimal diameter of mandrel acc table 8.1N
NA_Alphacc_92_1_1 = 19
NA_Alphacc_92_1_1
NA_Alphacc_92_2 = 23
NA_Alphacc_92_2
NA_Alphaccpl_92_1_1 = 21
NA_Alphaccpl_92_1_1
NA_Alphact_92_1_1 = 20
NA_Alphact_92_1_1
NA_Alphact_92_2 = 24
NA_Alphact_92_2
NA_Alphactpl_92_1_1 = 22
NA_Alphactpl_92_1_1
NA_CoeffEpsudByEpsuk = 5
ration of design and characteristics strain limit - reinforcement
NA_CoeffEpsudByEpsuk_p = 6
ration of design and characteristics strain limit - prestressed reinforcement
NA_EN1992_3_7_3_1_112_x_min = 157
x lim crack width
NA_EN1992_3_CrackWidth = 158
crack width limitation
NA_EN1992_3_CrackWidth_XA2_XA3_XF2_XF3_XF4 = 206
crack width limitation
NA_GammaC = 2
partial factor for concrete for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
NA_GammaC_BLR = 198
BLR partial factor for concrete for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
NA_GammaCfat = 124
partial factor for concrete for fatigue - ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
NA_GammaFfat = 123
The partial factor for fatigue loads DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 6.8.4 (1)
NA_GammaS = 3
partial factor for reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
NA_GammaSP = 4
partial factor for prestressed reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
NA_GammaSP_BLR = 200
partial factor for prestressed reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
NA_GammaSPfat = 126
partial factor for fatigue - for prestressed reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
NA_GammaS_BLR = 199
BLR partial factor for reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
NA_GammaSfat = 125
partial factor for reinforcement for fatigue - ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
NA_J_3_2_K1 = 117
coefficient k1 - SaT bracket
NA_J_3_3_K2 = 118
coefficient k2 - SaT bracket
NA_K1Fatigue = 131
coefficient k1 for fatigue
NA_K2Fatigue = 166
6.8.4 (5) Pokud se použijí pravidla 6.8 pro vyhodnocení zbytkové životnosti existující konstrukce nebo pro posouzení potřeby jejího zesílení, pak pokud začala koroze, lze stanovit rozkmit napětí sníženým exponentem napětí k2 pro přímé a ohýbané pruty /// DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 6.8.4 (5)
NA_LimitCharacteristic = 92
limit deformation - characteristics deformation
NA_LimitInfrequent = 93
limit deformation - infrequent deformation
NA_LimitQuasiPermanent = 91
limit deformation - quasi-permanent deformation
NA_LoadDuration = 18
NA_LoadDuration
NA_NCyclesFatigue = 130
N fatigue cycles 6.8.7 Verification of concrete under compression or shear DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 6.8.7 (1)
NA_NN_112_Gamma_sd = 194
coefficient
NA_Table7_101DE_1992_2 = 173
NDP zu 7.3.1 (105) Es gelten Tabelle 7.101DE
NA_Table7_102DE_1992_2 = 174
NDP zu 7.3.1 (105) Es gelten Tabelle 7.102DE
NA_Table7_103DE_1992_2 = 177
NDP zu 7.3.1 (105) Es gelten Tabelle 7.103DE
NA_TableFatigue6101N = 129
table 6.101N for fatigue - parameters for reinforcement steel - Dutch annex
NA_TableFatigue63N = 127
table 6.3N for fatigue - parameters for reinforcement steel DIN EN 1992-1-1/NA:2011-01 April 2013 NCI re 6.8.4, Table 6.3N
NA_TableFatigue63N_1992_2 = 168
table 6.3N for fatigue - parameters for reinforcement steel DIN EN 1992-2/NA 2013 NCI re 6.8.4, Table 6.3N
NA_TableFatigue64N = 128
table 6.4N for fatigue - parameters for prestress steel DIN EN 1992-1-1/NA:2011-01 April 2013 NCI re 6.8.4, Table 6.4N
NA_TableFatigue64N_1992_2 = 169
table 6.4N for fatigue - parameters for prestress steel DIN EN 1992-2/NA April 2013 NCI re 6.8.4, Table 6.4N
NA_k_p = 57
ductility factor for prestressed reinforcement
NeglectRedistributionOfMoments = 149
Neglect redistribution of moments My, Mz, if the ratio My/Mz is less than 10%
NoResistanceOfConcreteInTension1D = 148
No resistance of concrete in tension - members 1D
NoResistanceOfConcreteInTension2D = 203
No resistance of concrete in tension - plates
NoTendonExclusion = 162
dont exclude tendons from calculation model of cross-section
NonlinearCreep = 151
calculation of non-linear creep
NumberPartsOfDM = 204
number of parts on design member
PlaneDiagramCount = 69
Number of the plane interaction diagrams
SaTMethodType = 119
type of SAT method
SetupTable45n1991_2 = 132
table 4.5(n) acc 1991-2 - Indicative number of heavy vehicles expected per year and per slow lane
SimplifiedCssModel = 197
Use simplified calculation model of cross-section (reinforcement bars in layers are substituted by rectangle polygon component)
StressLimit_TypeFctm = 48
stress limitation - type calculation of concrete stress limitation in tension
StrutAngleOptimalization = 155
calculate optimalization of strut angle in shear, torsion and interaction
SubintervalsPerDecade = 139
Minimal number of time nodes per decade
Table74N = 76
Values in table 74N
Table74N_1992_1_1 = 176
Values in table 74N
TableJointParameters = 136
6.2.5 (2) Parameters of joint
Theta = 25
Theta
ThetaMax = 27
ThetaMax
ThetaMin = 26
ThetaMin
Theta_c = 51
lateral shear - angle theta - compressed flange
Theta_max_f = 54
lateral shear - max angle theta
Theta_min_c = 53
lateral shear - min angle theta - compressed flange
Theta_min_t = 52
lateral shear - min angle theta - tensioned flange
Theta_t = 50
lateral shear - angle theta - tensioned flange
TypeOfInitialstateOfCSS = 153
TypeOfInitialstateOfCSS
TypeSLSCalculation = 202
set of SLS calculation 0 - both 1 - short-term 2 - long-term
UseGammalt = 72
The safety factor for long-term extrapolation of delayed strains, see Ec2-2 B.105. Is used for calculation of creep effect. The value Gamma lt is calculated.
UserValuesForShear = 75
User values for shear calculation - d and z
VestigalResistance = 161
Vestigal resistance
WeakenedByBars = 58
weakened by bars - all bars area is subtract for concrete area
WeakenedByDucts = 60
weakened by ducts - all ducts area is subtract for concrete area
WeakenedByTendons = 59
weakened by tendons - all tendons area is subtract for concrete area
Fields
 Name |  Description
 AllowCheckInAgeLess3Days = 152
true to allow check in concrete age less than 3 days
 AlphaCw = 32
AlphaCw
 AnchorageDetailType = 122
anchorage of reinforcement according to type
 BLRPRecisionCheckValue = 201
precision of bridge load rating - check value
 BentUpBarsReduction = 154
reduction coefficinet of bent-up bars
 CalculateShrinkage = 205
calculate influence of shrinkage to stiffnesses
 CalculateSrMaxAccUserSettings = 135
sr,max, is calculated according to user
 CalculationOfStressLimitationK1 = 207
calculation of stress limitation k1
 CalculationOfStressLimitationK2 = 208
calculation of stress limitation k2
 CalculationOfStressLimitationK3 = 209
calculation of stress limitation k3
 CheckCrackedCss = 74
Check cracks during shear calculation
 CheckCrossSectionCrackedIfOneCracked_7_2_Chapter = 102
switch if the cross section should be calculated as cracked
 CoeffCrdc = 28
CoeffCrdc
 CoeffK1 = 29
CoeffK1
 CoeffKl = 49
lateral shear - coefficient k (6.2.4 (6))
 CoeffKp = 33
CoeffKp
 CoeffNi = 104
strength reduction factor
 CoeffNi1 = 31
CoeffNi1
 CoeffNi1_EN2_2 = 183
coeff ni1 for EN2-2
 CoeffVmin = 30
CoeffVmin
 CoefficientOfTensionConcrete = 195
coefficient witch reduce the tension strength
 CracWidthNationalAnnex = 160
use some annex specialities in common eurocode
 CracksPassThrough = 159
CracksPassThrough
 CrossSectionCrackedPlate = 134
on - the cross-section is calculated always as cracked
 DecompressionLimit = 77
The decompression limit requires that all parts of the bonded tendons or duct lie at least 25 mm within concrete in compression for 1992-1-1
 DecompressionLimit_2 = 78
The decompression limit requires that all parts of the bonded tendons or duct lie at least 25 mm within concrete in compression for 1992_2
 DecompressionLimit_3 = 167
NCI re 7.3.1 (5) In order to keep within the decompression limit, it is required that the concrete surrounding the tendon is in compression over a width of 100 mm or 1/10 of the depth of section (whichever is greater). Stresses are to be checked in state II.
 DetailingBracketMethodType = 120
calculation method of transversal reinforcement
 DivisionStrain = 70
Division of the plane interaction diagram
 EndOfCuring = 71
The age of the concrete (days) at the beginning of drying shrinkage (or swelling) in days. Normally this is at the end of curing.
 Equation629 = 171
Equation 6.29 acc. to DIN NCI re 6.3.2 (4)
 Equation631 = 172
Equation 6.31 acc. to DIN NCI re 6.3.2 (5)
 FatigueJointCohesion = 175
Under fatigue or dynamic loads, the values for c in 6.2.5 (1) should be halved.
 FatigueMethod = 133
6.8.7 Verification of concrete under compression or shear
 FindOnly2DPlaneDeformation = 196
FindOnly2DPlaneDeformation
 HighStrengthConcrete = 163
High strength concrete for DIN NCI re 3.1.2 (6)
 ImperfectionDirection = 110
direction of imperfection for second order effect
 IncreaseJointResistance = 170
the bearing capacity of the reinforcement crossing the joint due to shear friction (third term of the equation) may be increased to become ρ fyd (1,2 μ sin α + cos α).
 InnerPerimeter = 164
Inner perimeter for DIN NCI re 3.1.4 (5)
 InteractionDiagramCheckType = 9
InteractionDiagramCheckType
 InteractionDiagramDivision = 112
division of interaction diagram for export
 InteractionDiagramExportType = 146
type of interaction diagram for export
 InterpolationCurve = 111
type of interpolate curce
 IsSetMrForULSMNKappaDiagram = 156
IsSetMrForULSMNKappaDiagram
 IsSetPrecissionForNullForces = 147
settings if null forces are checked with some precissions
 IterationPrecission = 7
Iteration Precission
 IterationSteps = 8
Iteration Steps
 JointShearStressType = 138
Type of shear stress calculation
 LimitCheckValue = 0
The limit check value, when check is over - check is not satisfactory
 LimitDeflectionAdvanced = 106
limit value of deflection for deflection requrement advanced
 LimitDeflectionNormal = 105
limit value of deflection for deflection requirement normal
 LimitDeflectionValue = 108
limit value as value
 LimitLeverArm = 165
Limit for lever arm acc. to DIN NCI re 6.2.3 (1)
 LinearStiffnessForDeflection = 109
linear stiffness for deflection calculation - only for debug
 MaxBentUpReinfDist = 178
maximum longitudinal spacing of bent-up bars
 MaxDisplayCheckValue = 1
The infinity check value. This will be displayed when the check value equals to infinity or check wasn't calculated.
 MaxHorReinfDistWall = 83
Maximal spacing of horizontal reinforcement
 MaxHorReinfDistWall_EN2_2 = 188
maximum horizontal long reinf distance for EN2-2
 MaxLengthOfZone = 107
maximum length of zone to divide member for stiffness calculation
 MaxLongReinfDist = 37
maximum long reinf distance
 MaxLongReinfPercBeam = 35
maximum long reinf percentage
 MaxLongReinfPercBeam_EN2_2 = 185
maximum long reinf percentage for EN2-2
 MaxLongReinfPercColumn = 43
maximum long reinf percentage
 MaxMainReinfDistSlab = 89
Maximal spacing of main reinforcement
 MaxMainReinfDistSlab_EN2_2 = 186
maximum main long reinf distance for EN2-2
 MaxMainReinfPercSlab = 87
Maximal reinforcement ratio of main reinforcement
 MaxReinfDistDeepBeam = 85
Maximal spacing of reinforcement
 MaxShearReinfDistBeam = 40
maximum shear reinf distance
 MaxShearReinfDistColumn = 46
maximum shear reinf distance
 MaxShearReinfDistSlab = 180
maximum longitudinal spacing of successive series of links for slab
 MaxShearReinfPercBeam = 39
maximum shear reinf percentage
 MaxShearReinfTransDist = 41
maximum shear reinf trans distance
 MaxShearReinfTransDistSlab = 181
maximum transverse spacing of shear reinforcement for slab
 MaxTransReinfDistSlab = 90
Maximal spacing of transverse reinforcement
 MaxTransReinfDistSlab_EN2_2 = 187
maximum transversal long reinf distance for EN2-2
 MaxVertReinfDistWall = 81
Maximal spacing of vertical reinforcement
 MaxVertReinfPercWall = 80
Maximal reinforcement ratio of vertical reinforcement
 MinAnchLenShear = 121
minimum anchorage length of shear reinforcement
 MinDuctHorDist = 97
Minimal horizontal distance of ducts
 MinDuctVertDist = 96
Minimal vertical distance of ducts
 MinHorReinfPercWall = 82
Minimal reinforcement ratio of horizontal reinforcement
 MinLongReinfDiamColumn = 44
minimum long reinf diameter
 MinLongReinfDist = 36
minimum long reinf distance
 MinLongReinfPercBeam = 34
detailing beam minimum long reinf percentage
 MinLongReinfPercBeam_EN2_2 = 184
minimum long reinf percentage for EN2-2
 MinLongReinfPercColumn = 42
detailing column minimum long reinf percentage
 MinMainReinfPercSlab = 86
Minimal reinforcement ratio of main reinforcement
 MinNoBarCircColumn = 45
minimum number of bars of long reinf
 MinReinfPercDeepBeam = 84
Minimal reinforcement ratio
 MinReinfPercDeepBeam_EN2_2 = 189
minimum long reinf percentage for EN2-2
 MinShearReinfDiamColumn = 47
minimum shear reinf diameter
 MinShearReinfDiamColumn_EN2_2 = 182
minimum shear reinf diameter EN2-2
 MinShearReinfPercBeam = 38
minimum shear reinf percentage
 MinShearReinfPercSlab = 179
Minimal shear reinforcement percentage for slab
 MinTendonHorDist = 95
Minimal horizontal distance of tendons
 MinTendonVertDist = 94
Minimal vertical distance of tendons
 MinTransReinfPercSlab = 88
Minimal reinforcement ratio of transverse reinforcement
 MinVertReinfPercWall = 79
Minimal reinforcement ratio of vertical reinforcement
 ModulusType = 61
Type of E-modulus, which is used in calculations
 ModulusTypeLongTermEffects = 137
Type of E-modulus, which is used in calculations of long-term effects
 NA_1_Wmax_Ec2 = 150
NA_1_Wmax_Ec2
 NA_2_4_2_2_Gamma_p_fav = 66
Partial factors for prestress The value of 􀁊P,fav for use in a Country may be found in its National Annex. The recommended value for persistent and transient design situations is 1,0. This value may also be used for fatigue verification
 NA_2_4_2_2_Gamma_p_unfav = 67
Partial factors for prestress The value of 􀁊P,unfav in the stability limit state for use in a Country may be found in its National Annex. The recommended value for global analysis is 1,3.
 NA_5_10_2_1_1_K1 = 98
maximum tendon stress coeff k1 in 5.10.2.1(1)P
 NA_5_10_2_1_1_K2 = 99
maximum tendon stress coeff k2 in 5.10.2.1(1)P
 NA_5_10_3_2_K7 = 100
maximum tendon stress coeff k7 in 5.10.3(2)
 NA_5_10_3_2_K8 = 101
maximum tendon stress coeff k8 in 5.10.3(2)
 NA_5_10_9_r_inf_post = 65
Effects of prestressing at serviceability limit state and limit state of fatigue The values of rsup and rinf for use in a Country may be found in its National Annex. The recommended values are:
for post-tensioning with bonded tendons: rsup = 1,10 and rinf = 0,90
when appropriate measures (e.g. direct measurements of pretensioning) are taken: rsup = rinf = 1,0.
 NA_5_10_9_r_inf_pre = 63
Effects of prestressing at serviceability limit state and limit state of fatigue The values of rsup and rinf for use in a Country may be found in its National Annex. The recommended values are:
for pre-tensioning or unbonded tendons: rsup = 1,05 and rinf = 0,95
when appropriate measures (e.g. direct measurements of pretensioning) are taken: rsup = rinf = 1,0.
 NA_5_10_9_r_sup_post = 64
Effects of prestressing at serviceability limit state and limit state of fatigue The values of rsup and rinf for use in a Country may be found in its National Annex. The recommended values are:
for post-tensioning with bonded tendons: rsup = 1,10 and rinf = 0,90
when appropriate measures (e.g. direct measurements of pretensioning) are taken: rsup = rinf = 1,0.
 NA_5_10_9_r_sup_pre = 62
Effects of prestressing at serviceability limit state and limit state of fatigue The values of rsup and rinf for use in a Country may be found in its National Annex. The recommended values are:
for pre-tensioning or unbonded tendons: rsup = 1,05 and rinf = 0,95
when appropriate measures (e.g. direct measurements of pretensioning) are taken: rsup = rinf = 1,0.
 NA_5_2_5_Theta0 = 55
The the basic value of imperfections (See 5.2 (5)).
 NA_5_5_K1 = 140
returns K1 coefficient according to 5.5 EN 1992-1-1
 NA_5_5_K2 = 141
returns K2 coefficient according to 5.5 EN 1992-1-1
 NA_5_5_K3 = 142
returns K3 coefficient according to 5.5 EN 1992-1-1
 NA_5_5_K4 = 143
returns K4 coefficient according to 5.5 EN 1992-1-1
 NA_5_5_K5 = 144
returns K5 coefficient according to 5.5 EN 1992-1-1
 NA_5_5_K5_fck_BiggerThan_50MPa = 190
returns K5 coefficient according to DIN EN 1992-2/NA April 2013 NDP re 5.5 (4)
 NA_5_5_K6 = 145
returns K6 coefficient according to 5.5 EN 1992-1-1
 NA_5_5_K6_fck_BiggerThan_50MPa = 191
returns K5 coefficient according to DIN EN 1992-2/NA April 2013NDP re 5.5 (4)
 NA_5_8_6_3_GammaCe = 56
Partial safety factor for second order effect design, see 5.8.6 (3).
 NA_6_5_2_3_Ni = 113
coefficient ni - SaT
 NA_6_5_4_4_K1 = 114
coefficient k1 - SaT
 NA_6_5_4_4_K2 = 115
coefficient k2 - SaT
 NA_6_5_4_4_K3 = 116
coefficient k3 - SaT
 NA_7_2_K1 = 11
EN 1992-1-1 7.2 (2) DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (2)
 NA_7_2_K2 = 12
EN 1992-1-1 7.2 (3) DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (3)
 NA_7_2_K3 = 13
EN 1992-1-1 7.2 (5) DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (5)
 NA_7_2_K4 = 14
EN 1992-1-1 7.2 (5) DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (5)
 NA_7_2_K5 = 15
EN 1992-1-1 7.2 (5) DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (5)
 NA_7_3_1_DecompressionDistance = 68
The durability of prestressed members may be more critically affected by cracking. In the absence of more detailed requirements, it may be assumed that limiting the calculated crack widths to the values of wmax given in Table 7.1N, under the frequent combination of loads, will generally be satisfactory for prestressed concrete members. The decompression limit requires that all parts of the bonded tendons or duct lie at least 100 mm within concrete in compression
 NA_7_3_1_Wmax_Ec2_1_1 = 10
NA_7_3_1_Wmax_Ec2_1_1
 NA_7_3_1_Wmax_Ec2_2 = 73
NA_7_3_1_Wmax_Ec2_2
 NA_7_3_4_K1 = 192
is a coefficient which takes account of the bond properties of the bonded reinforcement
 NA_7_3_4_K2 = 193
is a coefficient which takes account of the distribution of strain
 NA_7_3_4_K3 = 16
NA_7_3_4_K3
 NA_7_3_4_K4 = 17
NA_7_3_4_K4
 NA_8_3_2_MinDiameterOfMandrel = 103
minimal diameter of mandrel acc table 8.1N
 NA_Alphacc_92_1_1 = 19
NA_Alphacc_92_1_1
 NA_Alphacc_92_2 = 23
NA_Alphacc_92_2
 NA_Alphaccpl_92_1_1 = 21
NA_Alphaccpl_92_1_1
 NA_Alphact_92_1_1 = 20
NA_Alphact_92_1_1
 NA_Alphact_92_2 = 24
NA_Alphact_92_2
 NA_Alphactpl_92_1_1 = 22
NA_Alphactpl_92_1_1
 NA_CoeffEpsudByEpsuk = 5
ration of design and characteristics strain limit - reinforcement
 NA_CoeffEpsudByEpsuk_p = 6
ration of design and characteristics strain limit - prestressed reinforcement
 NA_EN1992_3_7_3_1_112_x_min = 157
x lim crack width
 NA_EN1992_3_CrackWidth = 158
crack width limitation
 NA_EN1992_3_CrackWidth_XA2_XA3_XF2_XF3_XF4 = 206
crack width limitation
 NA_GammaC = 2
partial factor for concrete for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
 NA_GammaC_BLR = 198
BLR partial factor for concrete for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
 NA_GammaCfat = 124
partial factor for concrete for fatigue - ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
 NA_GammaFfat = 123
The partial factor for fatigue loads DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 6.8.4 (1)
 NA_GammaS = 3
partial factor for reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
 NA_GammaSP = 4
partial factor for prestressed reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
 NA_GammaSP_BLR = 200
partial factor for prestressed reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
 NA_GammaSPfat = 126
partial factor for fatigue - for prestressed reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
 NA_GammaS_BLR = 199
BLR partial factor for reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
 NA_GammaSfat = 125
partial factor for reinforcement for fatigue - ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
 NA_J_3_2_K1 = 117
coefficient k1 - SaT bracket
 NA_J_3_3_K2 = 118
coefficient k2 - SaT bracket
 NA_K1Fatigue = 131
coefficient k1 for fatigue
 NA_K2Fatigue = 166
6.8.4 (5) Pokud se použijí pravidla 6.8 pro vyhodnocení zbytkové životnosti existující konstrukce nebo pro posouzení potřeby jejího zesílení, pak pokud začala koroze, lze stanovit rozkmit napětí sníženým exponentem napětí k2 pro přímé a ohýbané pruty /// DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 6.8.4 (5)
 NA_LimitCharacteristic = 92
limit deformation - characteristics deformation
 NA_LimitInfrequent = 93
limit deformation - infrequent deformation
 NA_LimitQuasiPermanent = 91
limit deformation - quasi-permanent deformation
 NA_LoadDuration = 18
NA_LoadDuration
 NA_NCyclesFatigue = 130
N fatigue cycles 6.8.7 Verification of concrete under compression or shear DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 6.8.7 (1)
 NA_NN_112_Gamma_sd = 194
coefficient
 NA_Table7_101DE_1992_2 = 173
NDP zu 7.3.1 (105) Es gelten Tabelle 7.101DE
 NA_Table7_102DE_1992_2 = 174
NDP zu 7.3.1 (105) Es gelten Tabelle 7.102DE
 NA_Table7_103DE_1992_2 = 177
NDP zu 7.3.1 (105) Es gelten Tabelle 7.103DE
 NA_TableFatigue6101N = 129
table 6.101N for fatigue - parameters for reinforcement steel - Dutch annex
 NA_TableFatigue63N = 127
table 6.3N for fatigue - parameters for reinforcement steel DIN EN 1992-1-1/NA:2011-01 April 2013 NCI re 6.8.4, Table 6.3N
 NA_TableFatigue63N_1992_2 = 168
table 6.3N for fatigue - parameters for reinforcement steel DIN EN 1992-2/NA 2013 NCI re 6.8.4, Table 6.3N
 NA_TableFatigue64N = 128
table 6.4N for fatigue - parameters for prestress steel DIN EN 1992-1-1/NA:2011-01 April 2013 NCI re 6.8.4, Table 6.4N
 NA_TableFatigue64N_1992_2 = 169
table 6.4N for fatigue - parameters for prestress steel DIN EN 1992-2/NA April 2013 NCI re 6.8.4, Table 6.4N
 NA_k_p = 57
ductility factor for prestressed reinforcement
 NeglectRedistributionOfMoments = 149
Neglect redistribution of moments My, Mz, if the ratio My/Mz is less than 10%
 NoResistanceOfConcreteInTension1D = 148
No resistance of concrete in tension - members 1D
 NoResistanceOfConcreteInTension2D = 203
No resistance of concrete in tension - plates
 NoTendonExclusion = 162
dont exclude tendons from calculation model of cross-section
 NonlinearCreep = 151
calculation of non-linear creep
 NumberPartsOfDM = 204
number of parts on design member
 PlaneDiagramCount = 69
Number of the plane interaction diagrams
 SaTMethodType = 119
type of SAT method
 SetupTable45n1991_2 = 132
table 4.5(n) acc 1991-2 - Indicative number of heavy vehicles expected per year and per slow lane
 SimplifiedCssModel = 197
Use simplified calculation model of cross-section (reinforcement bars in layers are substituted by rectangle polygon component)
 StressLimit_TypeFctm = 48
stress limitation - type calculation of concrete stress limitation in tension
 StrutAngleOptimalization = 155
calculate optimalization of strut angle in shear, torsion and interaction
 SubintervalsPerDecade = 139
Minimal number of time nodes per decade
 Table74N = 76
Values in table 74N
 Table74N_1992_1_1 = 176
Values in table 74N
 TableJointParameters = 136
6.2.5 (2) Parameters of joint
 Theta = 25
Theta
 ThetaMax = 27
ThetaMax
 ThetaMin = 26
ThetaMin
 Theta_c = 51
lateral shear - angle theta - compressed flange
 Theta_max_f = 54
lateral shear - max angle theta
 Theta_min_c = 53
lateral shear - min angle theta - compressed flange
 Theta_min_t = 52
lateral shear - min angle theta - tensioned flange
 Theta_t = 50
lateral shear - angle theta - tensioned flange
 TypeOfInitialstateOfCSS = 153
TypeOfInitialstateOfCSS
 TypeSLSCalculation = 202
set of SLS calculation 0 - both 1 - short-term 2 - long-term
 UseGammalt = 72
The safety factor for long-term extrapolation of delayed strains, see Ec2-2 B.105. Is used for calculation of creep effect. The value Gamma lt is calculated.
 UserValuesForShear = 75
User values for shear calculation - d and z
 VestigalResistance = 161
Vestigal resistance
 WeakenedByBars = 58
weakened by bars - all bars area is subtract for concrete area
 WeakenedByDucts = 60
weakened by ducts - all ducts area is subtract for concrete area
 WeakenedByTendons = 59
weakened by tendons - all tendons area is subtract for concrete area
 Edit this page